Revit 2024 API
FilePath Constructor
 Constructs a FilePath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public FilePath(
	string path
)
Visual Basic
Public Sub New ( _
	path As String _
)
Visual C++
public:
FilePath(
	String^ path
)
Parameters
path
Type: System.String
 The path to the file. This path does not have to be a full path; it can be relative.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilePath Class
Autodesk.Revit.DB Namespace